# Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# Пример:*
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: False
# список: ["123", "234", 123, "567"], ищем: "123", ответ: False
# список: [], ищем: "123", ответ: False
print("\033[H\033[J")

# my_list = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
# string = 'qwe'
my_list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
string = 'йцу'
# my_list = ["йцу", "фыв", "ячс", "цук", "йцукен"]
# string = 'йцу'
# my_list = ["123", "234", 123, "567"]
# string = '123'
# my_list = []
# string = '123'

count = 0
index = False

for i in range(len(my_list)):
    if my_list[i] == string:
        count += 1
        if count == 2:
            index = i
            break
    else:
        index = False

print (f'{my_list}, ищем: "{string}", ответ: {index}')


