# Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
print("\033[H\033[J")
x = bool(False)
y = bool(False)
z = bool(False)
#for i = 
#print(f'Значения: {x}, {y}, {z}')
