# Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) этих двух чисел.
print("\033[H\033[J")


# А если в цикле прогонять делитель и искать вариант при котором оба числа делятся на этот делитель без остатка