# Найдите корни квадратного уравнения Ax² + Bx + C = 0 с помощью математических формул нахождения корней квадратного уравнения
print("\033[H\033[J")

string = '12*x**2+7*x+5=0'
string_new = string.split('=')[:-1]
print(string_new)

